# 1. Explain what is Series and DataFrame in Pandas? How do they differ?

Series
- 1D(single array of data)
- 2-Homogeneous data (elements are of same data type)
- 3-series has only 2 objects
         -index and elements/values
- 4-it supports indexing, slicing and are mutable.
- 5-supports indexing for both int and label based indexing.
- 6-supports element wise operation and broadcasting.
- 7-supports statistical operations

DataFrame
- it is a 2D structure
- it consists of rows and columns along with row index and col index
- Heterogeneous data
- it also supports indexing, slicing, and are mutable.
- it supports statistical operations.

# 2. Create a Pandas Series from a list of 5 integers. Print the Series.

Example: Create a Series from [5, 10, 15, 20, 25]

In [17]:
import numpy as np
import pandas as pd

a= [5,10,15,20,25]
s1=pd.Series(a)
print(s1,type(s1))

0     5
1    10
2    15
3    20
4    25
dtype: int64 <class 'pandas.core.series.Series'>

# 3. Create a Simple DataFrame using the following dictionary and print it.

Create a DataFrame using the following data:

data = {
    'Name': ['John', 'Marry', 'Steve'],
    'Score': [85, 90, 78],
    'Subject': ['Math', 'English', 'Science']
}

In [24]:
import pandas as pd

data={ 
       'Name': ['John', 'Marry', 'Steve'], 
       'Score': [85, 90, 78], 
       'Subject': ['Math', 'English', 'Science'] 
     }
df_data=pd.DataFrame(data)
df_data

    Name  Score  Subject
0   John     85     Math
1  Marry     90  English
2  Steve     78  Science

# 4. Print only the 'Name' and 'Score' columns from the DataFrame.

In [29]:
df_data[['Name','Score']]

    Name  Score
0   John     85
1  Marry     90
2  Steve     78

# 5. Add a new column called Grade to the DataFrame and assign the value 'A' to all rows.

In [34]:
df_data["Grade"]="A"
df_data

    Name  Score  Subject Grade
0   John     85     Math     A
1  Marry     90  English     A
2  Steve     78  Science     A

# 6. Save the DataFrame to a CSV file named student_scores.csv

In [57]:
df_data.to_csv('student_scores.csv', index=False)

# 7. Load the saved student_scores.csv file back into a jupyter notebook and print all the data from the file.

In [60]:
s2=pd.read_csv('student_scores.csv')
print(s2)

    Name  Score  Subject Grade
0   John     85     Math     A
1  Marry     90  English     A
2  Steve     78  Science     A